DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/common/bl2_io_storage.c
	/* Close connection to device */
	io_result = io_dev_close(storage_dev_handle);
	assert(io_result == 0);
}

int bl2_plat_handle_pre_image_load(unsigned int image_id)
{
	static bool gpt_init_done __maybe_unused;
	uint16_t boot_itf = stm32mp_get_boot_itf_selected();

	if (stm32mp_skip_boot_device_after_standby()) {
		return 0;
	}

	switch (boot_itf) {
#if STM32MP_SDMMC || STM32MP_EMMC
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_EMMC:
#if STM32MP_EMMC_BOOT
		if (image_block_spec.offset == STM32MP_EMMC_BOOT_FIP_OFFSET) {
			break;
		}
#endif
		/* fallthrough */
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_SD:
		if (!gpt_init_done) {
/*
 * With FWU Multi Bank feature enabled, the selection of
 * the image to boot will be done by fwu_init calling the
 * platform hook, plat_fwu_set_images_source.
 */
#if !PSA_FWU_SUPPORT
			const partition_entry_t *entry;
			const struct efi_guid fip_guid = STM32MP_FIP_GUID;

			partition_init(GPT_IMAGE_ID);
			entry = get_partition_entry_by_type(&fip_guid);
			if (entry == NULL) {
				entry = get_partition_entry(FIP_IMAGE_NAME);
				if (entry == NULL) {
					ERROR("Could NOT find the %s partition!\n",
					      FIP_IMAGE_NAME);

					return -ENOENT;
				}
			}

			image_block_spec.offset = entry->start;
			image_block_spec.length = entry->length;
#endif
			gpt_init_done = true;
		} else {
			bl_mem_params_node_t *bl_mem_params = get_bl_mem_params_node(image_id);

			assert(bl_mem_params != NULL);

			mmc_block_dev_spec.buffer.offset = bl_mem_params->image_info.image_base;
			mmc_block_dev_spec.buffer.length = bl_mem_params->image_info.image_max_size;
		}

		break;
#endif

#if STM32MP_RAW_NAND || STM32MP_SPI_NAND
#if STM32MP_RAW_NAND
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_NAND_FMC:
#endif
#if STM32MP_SPI_NAND
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_NAND_SPI:
#endif
/*
 * With FWU Multi Bank feature enabled, the selection of
 * the image to boot will be done by fwu_init calling the
 * platform hook, plat_fwu_set_images_source.
 */
#if !PSA_FWU_SUPPORT
		image_block_spec.offset = STM32MP_NAND_FIP_OFFSET;
#endif
		break;
#endif

#if STM32MP_SPI_NOR
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_FLASH_NOR_SPI:
/*
 * With FWU Multi Bank feature enabled, the selection of
 * the image to boot will be done by fwu_init calling the
 * platform hook, plat_fwu_set_images_source.
 */
#if !PSA_FWU_SUPPORT
		image_block_spec.offset = STM32MP_NOR_FIP_OFFSET;
#endif
		break;
#endif

#if STM32MP_HYPERFLASH
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_HYPERFLASH_OSPI:
/*
 * With FWU Multi Bank feature enabled, the selection of
 * the image to boot will be done by fwu_init calling the
 * platform hook, plat_fwu_set_images_source.
 */
#if !PSA_FWU_SUPPORT
		image_block_spec.offset = STM32MP_HYPERFLASH_FIP_OFFSET;
#endif
		break;
#endif

#if STM32MP_UART_PROGRAMMER
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_SERIAL_UART:
#if STM32MP_DDR_FIP_IO_STORAGE
		if (image_id == DDR_FW_ID) {
			stm32cubeprogrammer_uart(PHASE_DDR_FW,
						 DWL_DDR_BUFFER_BASE,
						 DWL_DDR_BUFFER_SIZE);
			/* FIP loaded at DWL address */
			image_block_spec.offset = DWL_DDR_BUFFER_BASE;
			image_block_spec.length = DWL_DDR_BUFFER_SIZE;
		}
#endif
		if (image_id == FW_CONFIG_ID) {
#if STM32MP_DDR_FIP_IO_STORAGE && TRUSTED_BOARD_BOOT
			/*
			 * Clear authentication state of STM32MP certificate that will
			 * now be loaded from other FIP file
			 */
			auth_img_flags[STM32MP_CONFIG_CERT_ID] = 0U;
#endif
			stm32cubeprogrammer_uart(PHASE_SSBL,
						 DWL_BUFFER_BASE,
						 DWL_BUFFER_SIZE);
			/* FIP loaded at DWL address */
			image_block_spec.offset = DWL_BUFFER_BASE;
			image_block_spec.length = DWL_BUFFER_SIZE;
		}
		break;
#endif
#if STM32MP_USB_PROGRAMMER
	case BOOT_API_CTX_BOOT_INTERFACE_SEL_SERIAL_USB:
#if STM32MP_DDR_FIP_IO_STORAGE
		if (image_id == DDR_FW_ID) {
			stm32cubeprogrammer_usb(PHASE_DDR_FW,
						DWL_DDR_BUFFER_BASE,
						DWL_DDR_BUFFER_SIZE);
			/* FIP loaded at DWL address */
			image_block_spec.offset = DWL_DDR_BUFFER_BASE;
			image_block_spec.length = DWL_DDR_BUFFER_SIZE;
		}
#endif
		if (image_id == FW_CONFIG_ID) {
#if STM32MP_DDR_FIP_IO_STORAGE && TRUSTED_BOARD_BOOT
			/*
			 * Clear authentication state of STM32MP certificate that will
			 * now be loaded from other FIP file
			 */
			auth_img_flags[STM32MP_CONFIG_CERT_ID] = 0U;
#endif
			stm32cubeprogrammer_usb(PHASE_SSBL,
						DWL_BUFFER_BASE,
						DWL_BUFFER_SIZE);
			/* FIP loaded at DWL address */
			image_block_spec.offset = DWL_BUFFER_BASE;
			image_block_spec.length = DWL_BUFFER_SIZE;
		}
		break;
#endif

	default:
		ERROR("FIP Not found\n");
		panic();
	}

	return 0;
}

/*
 * Return an IO device handle and specification which can be used to access
 * an image. Use this to enforce platform load policy.
 */
int plat_get_image_source(unsigned int image_id, uintptr_t *dev_handle,
			  uintptr_t *image_spec)
{
	int rc;
	const struct plat_io_policy *policy;

	policy = FCONF_GET_PROPERTY(stm32mp, io_policies, image_id);
	rc = policy->check(policy->image_spec);
	if (rc == 0) {
		*image_spec = policy->image_spec;
		*dev_handle = *(policy->dev_handle);
	}

	return rc;
}

/*
 * This function shall return 0 if it cannot find an alternate
 * image to be loaded or it returns 1 otherwise.
 */
int plat_try_backup_partitions(unsigned int image_id)
{
	static unsigned int backup_id;
	static unsigned int backup_block_nb;

	/* Check if NAND storage used */
	if (nand_block_sz == 0U) {
		return 0;
	}

	if (backup_id != image_id) {
		backup_block_nb = PLATFORM_MTD_MAX_PART_SIZE / nand_block_sz;
		backup_id = image_id;
	}

	if (backup_block_nb-- == 0U) {
		return 0;
	}

#if PSA_FWU_SUPPORT
	if (((image_block_spec.offset < STM32MP_NAND_FIP_B_OFFSET) &&
	     ((image_block_spec.offset + nand_block_sz) >= STM32MP_NAND_FIP_B_OFFSET)) ||
	    (image_block_spec.offset + nand_block_sz >= STM32MP_NAND_FIP_B_MAX_OFFSET)) {
		return 0;
	}
#endif

	image_block_spec.offset += nand_block_sz;

	return 1;
}

#if PSA_FWU_SUPPORT
/*
 * In each boot in non-trial mode, we set the BKP register to
 * FWU_MAX_TRIAL_REBOOT, and return the active_index from metadata.
 *
 * As long as the update agent didn't update the "accepted" field in metadata
 * (i.e. we are in trial mode), we select the new active_index.
 * To avoid infinite boot loop at trial boot we decrement a BKP register.
 * If this counter is 0:
 *     - an unexpected TAMPER event raised (that resets the BKP registers to 0)
 *     - a power-off occurs before the update agent was able to update the
 *       "accepted' field
 *     - we already boot FWU_MAX_TRIAL_REBOOT times in trial mode.
 * we select the previous_active_index.
 */
uint32_t plat_fwu_get_boot_idx(void)
{
	/*
	 * Select boot index and update boot counter only once per boot
	 * even if this function is called several times.
	 */
	static uint32_t boot_idx = INVALID_BOOT_IDX;

	if (boot_idx == INVALID_BOOT_IDX) {
		const struct fwu_metadata *data = fwu_get_metadata();

		boot_idx = data->active_index;

		if (data->bank_state[boot_idx] == FWU_BANK_STATE_VALID) {
			if (stm32_get_and_dec_fwu_trial_boot_cnt() == 0U) {
				WARN("Trial FWU fails %u times\n",
				     FWU_MAX_TRIAL_REBOOT);
				boot_idx = fwu_get_alternate_boot_bank();
			}
		} else if (data->bank_state[boot_idx] ==
			   FWU_BANK_STATE_ACCEPTED) {
			stm32_set_max_fwu_trial_boot_cnt();
		} else {
			ERROR("The active bank(%u) of the platform is in Invalid State.\n",
				boot_idx);
			boot_idx = fwu_get_alternate_boot_bank();
			stm32_clear_fwu_trial_boot_cnt();
		}
	}

