DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/tf-a-2.8.15-r2/tf-a-stm32mp-v2.8.15-stm32mp-r2/plat/st/common/bl2_io_storage.c
	return boot_idx;
}

static void *stm32_get_image_spec(const struct efi_guid *img_type_guid)
{
	unsigned int i;

	for (i = 0U; i < MAX_NUMBER_IDS; i++) {
		if ((guidcmp(&policies[i].img_type_guid, img_type_guid)) == 0) {
			return (void *)policies[i].image_spec;
		}
	}

	return NULL;
}

void plat_fwu_set_images_source(const struct fwu_metadata *metadata)
{
	unsigned int i;
	uint32_t boot_idx;
	const partition_entry_t *entry __maybe_unused;
	const struct fwu_image_entry *img_entry;
	const void *img_type_guid;
	const void *img_guid;
	io_block_spec_t *image_spec;

	boot_idx = plat_fwu_get_boot_idx();
	assert(boot_idx < NR_OF_FW_BANKS);
	VERBOSE("Selecting to boot from bank %u\n", boot_idx);

	img_entry = (void *)&metadata->fw_desc.img_entry;
	for (i = 0U; i < NR_OF_IMAGES_IN_FW_BANK; i++) {
		img_type_guid = &img_entry[i].img_type_guid;

		img_guid = &img_entry[i].img_bank_info[boot_idx].img_guid;

		image_spec = stm32_get_image_spec(img_type_guid);
		if (image_spec == NULL) {
			ERROR("Unable to get image spec for the image in the metadata\n");
			panic();
		}

#if (STM32MP_SDMMC || STM32MP_EMMC)
		entry = get_partition_entry_by_guid(img_guid);
		if (entry == NULL) {
			ERROR("No partition with the uuid mentioned in metadata\n");
			panic();
		}

		image_spec->offset = entry->start;
		image_spec->length = entry->length;
#endif
#if STM32MP_SPI_NOR
		if (guidcmp(img_guid, &STM32MP_NOR_FIP_A_GUID) == 0) {
			image_spec->offset = STM32MP_NOR_FIP_A_OFFSET;
		} else if (guidcmp(img_guid, &STM32MP_NOR_FIP_B_GUID) == 0) {
			image_spec->offset = STM32MP_NOR_FIP_B_OFFSET;
		} else {
			ERROR("Invalid uuid mentioned in metadata\n");
			panic();
		}
#endif
#if (STM32MP_SPI_NAND || STM32MP_RAW_NAND)
		if (guidcmp(img_guid, &STM32MP_NAND_FIP_A_GUID) == 0) {
			image_spec->offset = STM32MP_NAND_FIP_A_OFFSET;
		} else if (guidcmp(img_guid, &STM32MP_NAND_FIP_B_GUID) == 0) {
			image_spec->offset = STM32MP_NAND_FIP_B_OFFSET;
		} else {
			ERROR("Invalid uuid mentioned in metadata\n");
			panic();
		}
#endif
#if STM32MP_HYPERFLASH
		if (guidcmp(img_guid, &STM32MP_HYPERFLASH_FIP_A_GUID) == 0) {
			image_spec->offset = STM32MP_HYPERFLASH_FIP_A_OFFSET;
		} else if (guidcmp(img_guid, &STM32MP_HYPERFLASH_FIP_B_GUID) == 0) {
			image_spec->offset = STM32MP_HYPERFLASH_FIP_B_OFFSET;
		} else {
			ERROR("Invalid uuid mentioned in metadata\n");
			panic();
		}
#endif
	}
}

static int plat_set_image_source(unsigned int image_id,
				 uintptr_t *handle,
				 uintptr_t *image_spec)
{
	struct plat_io_policy *policy;
	io_block_spec_t *spec __maybe_unused;
	const partition_entry_t *entry __maybe_unused;

	policy = &policies[image_id];
	spec = (io_block_spec_t *)policy->image_spec;

#if (STM32MP_SDMMC || STM32MP_EMMC)
	partition_init(GPT_IMAGE_ID);

	if (image_id == FWU_METADATA_IMAGE_ID) {
		entry = get_partition_entry(METADATA_PART_1);
	} else {
		entry = get_partition_entry(METADATA_PART_2);
	}

	if (entry == NULL) {
		ERROR("Unable to find a metadata partition\n");
		return -ENOENT;
	}

	spec->offset = entry->start;
	spec->length = entry->length;
#endif

#if STM32MP_SPI_NOR
	if (image_id == FWU_METADATA_IMAGE_ID) {
		spec->offset = STM32MP_NOR_METADATA1_OFFSET;
	} else {
		spec->offset = STM32MP_NOR_METADATA2_OFFSET;
	}

	spec->length = sizeof(struct fwu_metadata);
#endif

#if (STM32MP_SPI_NAND || STM32MP_RAW_NAND)
	if (image_id == FWU_METADATA_IMAGE_ID) {
		spec->offset = STM32MP_NAND_METADATA1_OFFSET;
	} else {
		spec->offset = STM32MP_NAND_METADATA2_OFFSET;
	}

	spec->length = sizeof(struct fwu_metadata);
#endif

#if STM32MP_HYPERFLASH
	if (image_id == FWU_METADATA_IMAGE_ID) {
		spec->offset = STM32MP_HYPERFLASH_METADATA1_OFFSET;
	} else {
		spec->offset = STM32MP_HYPERFLASH_METADATA2_OFFSET;
	}

	spec->length = sizeof(struct fwu_metadata);
#endif

	*image_spec = policy->image_spec;
	*handle = *policy->dev_handle;

	return 0;
}

int plat_fwu_set_metadata_image_source(unsigned int image_id,
				       uintptr_t *handle,
				       uintptr_t *image_spec)
{
	assert((image_id == FWU_METADATA_IMAGE_ID) ||
	       (image_id == BKUP_FWU_METADATA_IMAGE_ID));

	return plat_set_image_source(image_id, handle, image_spec);
}

bool plat_fwu_is_enabled(void)
{
	return !stm32mp_skip_boot_device_after_standby();
}
#endif /* PSA_FWU_SUPPORT */
